{
  "return_dict": true,
  "output_hidden_states": false,
  "output_attentions": false,
  "torchscript": false,
  "torch_dtype": null,
  "use_bfloat16": false,
  "tf_legacy_loss": false,
  "pruned_heads": {},
  "tie_word_embeddings": true,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "architectures": [
    "RobertaForMaskedLM"
  ],
  "finetuning_task": null,
  "id2label": {
    "0": "O",
    "1": "B-CARDINAL",
    "2": "B-DATE",
    "3": "I-DATE",
    "4": "B-PERSON",
    "5": "I-PERSON",
    "6": "B-NORP",
    "7": "B-GPE",
    "8": "I-GPE",
    "9": "B-LAW",
    "10": "I-LAW",
    "11": "B-ORG",
    "12": "I-ORG",
    "13": "B-PERCENT",
    "14": "I-PERCENT",
    "15": "B-ORDINAL",
    "16": "B-MONEY",
    "17": "I-MONEY",
    "18": "B-WORK_OF_ART",
    "19": "I-WORK_OF_ART",
    "20": "B-FAC",
    "21": "B-TIME",
    "22": "I-CARDINAL",
    "23": "B-LOC",
    "24": "B-QUANTITY",
    "25": "I-QUANTITY",
    "26": "I-NORP",
    "27": "I-LOC",
    "28": "B-PRODUCT",
    "29": "I-TIME",
    "30": "B-EVENT",
    "31": "I-EVENT",
    "32": "I-FAC",
    "33": "B-LANGUAGE",
    "34": "I-PRODUCT",
    "35": "I-ORDINAL",
    "36": "I-LANGUAGE"
  },
  "label2id": {
    "B-CARDINAL": 1,
    "B-DATE": 2,
    "B-EVENT": 30,
    "B-FAC": 20,
    "B-GPE": 7,
    "B-LANGUAGE": 33,
    "B-LAW": 9,
    "B-LOC": 23,
    "B-MONEY": 16,
    "B-NORP": 6,
    "B-ORDINAL": 15,
    "B-ORG": 11,
    "B-PERCENT": 13,
    "B-PERSON": 4,
    "B-PRODUCT": 28,
    "B-QUANTITY": 24,
    "B-TIME": 21,
    "B-WORK_OF_ART": 18,
    "I-CARDINAL": 22,
    "I-DATE": 3,
    "I-EVENT": 31,
    "I-FAC": 32,
    "I-GPE": 8,
    "I-LANGUAGE": 36,
    "I-LAW": 10,
    "I-LOC": 27,
    "I-MONEY": 17,
    "I-NORP": 26,
    "I-ORDINAL": 35,
    "I-ORG": 12,
    "I-PERCENT": 14,
    "I-PERSON": 5,
    "I-PRODUCT": 34,
    "I-QUANTITY": 25,
    "I-TIME": 29,
    "I-WORK_OF_ART": 19,
    "O": 0
  },
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": 0,
  "pad_token_id": 1,
  "eos_token_id": 2,
  "sep_token_id": null,
  "decoder_start_token_id": null,
  "task_specific_params": null,
  "problem_type": null,
  "_name_or_path": "roberta-large",
  "transformers_version": "4.45.2",
  "model_type": "roberta",
  "vocab_size": 50267,
  "hidden_size": 1024,
  "num_hidden_layers": 24,
  "num_attention_heads": 16,
  "hidden_act": "gelu",
  "intermediate_size": 4096,
  "hidden_dropout_prob": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "max_position_embeddings": 514,
  "type_vocab_size": 1,
  "initializer_range": 0.02,
  "layer_norm_eps": 0.00001,
  "position_embedding_type": "absolute",
  "use_cache": true,
  "classifier_dropout": null
}