{
  "encoder": {
    "_name_or_path": "roberta-large",
    "add_cross_attention": false,
    "architectures": [
      "RobertaForMaskedLM"
    ],
    "attention_probs_dropout_prob": 0.1,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": 0,
    "chunk_size_feed_forward": 0,
    "classifier_dropout": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": 2,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 1024,
    "id2label": {
      "0": "O",
      "1": "B-CARDINAL",
      "2": "B-DATE",
      "3": "I-DATE",
      "4": "B-PERSON",
      "5": "I-PERSON",
      "6": "B-NORP",
      "7": "B-GPE",
      "8": "I-GPE",
      "9": "B-LAW",
      "10": "I-LAW",
      "11": "B-ORG",
      "12": "I-ORG",
      "13": "B-PERCENT",
      "14": "I-PERCENT",
      "15": "B-ORDINAL",
      "16": "B-MONEY",
      "17": "I-MONEY",
      "18": "B-WORK_OF_ART",
      "19": "I-WORK_OF_ART",
      "20": "B-FAC",
      "21": "B-TIME",
      "22": "I-CARDINAL",
      "23": "B-LOC",
      "24": "B-QUANTITY",
      "25": "I-QUANTITY",
      "26": "I-NORP",
      "27": "I-LOC",
      "28": "B-PRODUCT",
      "29": "I-TIME",
      "30": "B-EVENT",
      "31": "I-EVENT",
      "32": "I-FAC",
      "33": "B-LANGUAGE",
      "34": "I-PRODUCT",
      "35": "I-ORDINAL",
      "36": "I-LANGUAGE"
    },
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "B-CARDINAL": 1,
      "B-DATE": 2,
      "B-EVENT": 30,
      "B-FAC": 20,
      "B-GPE": 7,
      "B-LANGUAGE": 33,
      "B-LAW": 9,
      "B-LOC": 23,
      "B-MONEY": 16,
      "B-NORP": 6,
      "B-ORDINAL": 15,
      "B-ORG": 11,
      "B-PERCENT": 13,
      "B-PERSON": 4,
      "B-PRODUCT": 28,
      "B-QUANTITY": 24,
      "B-TIME": 21,
      "B-WORK_OF_ART": 18,
      "I-CARDINAL": 22,
      "I-DATE": 3,
      "I-EVENT": 31,
      "I-FAC": 32,
      "I-GPE": 8,
      "I-LANGUAGE": 36,
      "I-LAW": 10,
      "I-LOC": 27,
      "I-MONEY": 17,
      "I-NORP": 26,
      "I-ORDINAL": 35,
      "I-ORG": 12,
      "I-PERCENT": 14,
      "I-PERSON": 5,
      "I-PRODUCT": 34,
      "I-QUANTITY": 25,
      "I-TIME": 29,
      "I-WORK_OF_ART": 19,
      "O": 0
    },
    "layer_norm_eps": 0.00001,
    "length_penalty": 1.0,
    "max_length": 20,
    "max_position_embeddings": 514,
    "min_length": 0,
    "model_type": "roberta",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 16,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_hidden_layers": 24,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": 1,
    "position_embedding_type": "absolute",
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "transformers_version": "4.28.1",
    "type_vocab_size": 1,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 50272
  },
  "model_max_length": 256,
  "model_max_length_default": 512,
  "marker_max_length": 128,
  "entity_max_length": 10,
  "max_prev_context": null,
  "max_next_context": null,
  "trained_with_document_context": false,
  "span_marker_version": "1.0.1",
  "return_dict": true,
  "output_hidden_states": false,
  "output_attentions": false,
  "torchscript": false,
  "torch_dtype": "float32",
  "use_bfloat16": false,
  "tf_legacy_loss": false,
  "pruned_heads": {},
  "tie_word_embeddings": true,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "architectures": [
    "SpanMarkerModel"
  ],
  "finetuning_task": null,
  "id2label": {
    "0": "O",
    "1": "CARDINAL",
    "2": "DATE",
    "3": "EVENT",
    "4": "FAC",
    "5": "GPE",
    "6": "LANGUAGE",
    "7": "LAW",
    "8": "LOC",
    "9": "MONEY",
    "10": "NORP",
    "11": "ORDINAL",
    "12": "ORG",
    "13": "PERCENT",
    "14": "PERSON",
    "15": "PRODUCT",
    "16": "QUANTITY",
    "17": "TIME",
    "18": "WORK_OF_ART"
  },
  "label2id": {
    "CARDINAL": 1,
    "DATE": 2,
    "EVENT": 3,
    "FAC": 4,
    "GPE": 5,
    "LANGUAGE": 6,
    "LAW": 7,
    "LOC": 8,
    "MONEY": 9,
    "NORP": 10,
    "O": 0,
    "ORDINAL": 11,
    "ORG": 12,
    "PERCENT": 13,
    "PERSON": 14,
    "PRODUCT": 15,
    "QUANTITY": 16,
    "TIME": 17,
    "WORK_OF_ART": 18
  },
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": null,
  "pad_token_id": null,
  "eos_token_id": null,
  "sep_token_id": null,
  "decoder_start_token_id": null,
  "task_specific_params": null,
  "problem_type": null,
  "_name_or_path": "tomaarsen/span-marker-roberta-large-ontonotes5",
  "transformers_version": "4.45.2",
  "id2reduced_id": {
    "0": 0,
    "1": 1,
    "2": 2,
    "3": 2,
    "4": 14,
    "5": 14,
    "6": 10,
    "7": 5,
    "8": 5,
    "9": 7,
    "10": 7,
    "11": 12,
    "12": 12,
    "13": 13,
    "14": 13,
    "15": 11,
    "16": 9,
    "17": 9,
    "18": 18,
    "19": 18,
    "20": 4,
    "21": 17,
    "22": 1,
    "23": 8,
    "24": 16,
    "25": 16,
    "26": 10,
    "27": 8,
    "28": 15,
    "29": 17,
    "30": 3,
    "31": 3,
    "32": 4,
    "33": 6,
    "34": 15,
    "35": 11,
    "36": 6
  },
  "model_type": "span-marker",
  "vocab_size": 50272
}